posts/2017-08-08-using-org-journal-to-maintain-a-daily-journal.org
   :PROPERTIES:
   :Time:     22:16
   :END:

Package [[https://github.com/bastibe/org-journal][org-journal]] is an extension to org-mode to easily create and maintain a
daily journal. I installed it and configured it as follows:
#+BEGIN_SRC emacs-lisp
(require 'org-journal)

# set the directory that will contain the journal files
(setq org-journal-dir "~/repos/bitbucket.org/journal")

# set the format of each date heading, where
# - %F specifies the ISO 8601 date format, e.g. 2017-08-08, and
# - %a specifies the locale's abbreviated name of the day of week
(setq org-journal-date-format "%F, %a")
#+END_SRC
For the list of allowed characters in the date format string and their meaning,
have a look at the documentation of Emacs function format-time-string.

At the time of writing, my main Linux environment environment variable LC_TIME
was set to nl_NL.UTF-8 so the abbreviated name of the week was in Dutch. The
following Emacs settings makes sure that that name is in English:
#+BEGIN_SRC emacs-lisp
(setq system-time-locale "en_US.UTF-8")
#+END_SRC
