output/posts/2017-08-08-using-org-journal-to-maintain-a-daily-journal.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Using org-journal to maintain a daily journal | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-08-08-using-org-journal-to-maintain-a-daily-journal.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="welcome-to-nikola.html" title="Welcome to Nikola" type="text/html">
<link rel="next" href="2017-08-09-issues-when-opening-an-org-journal-file-from-the-calender.html" title="Issues when opening an org-journal file from the calender" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="Using org-journal to maintain a daily journal">
<meta property="og:url" content="https://example.com/posts/2017-08-08-using-org-journal-to-maintain-a-daily-journal.html">
<meta property="og:description" content="Using org-journal to maintain a daily journal



Package org-journal is an extension to org-mode to easily create and maintain a
daily journal. I installed it and configured it as follows:

(require '">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-08T22:16:00+02:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="orgmode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-08-08-using-org-journal-to-maintain-a-daily-journal.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Using org-journal to maintain a daily journal</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-08-08T22:16:00+02:00" itemprop="datePublished" title="2017-08-08 22:16">2017-08-08 22:16</time></a></p>
            
        <p class="sourceline"><a href="2017-08-08-using-org-journal-to-maintain-a-daily-journal.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Using org-journal to maintain a daily journal</h2>
<div class="outline-text-2" id="text-1">

<p>
Package <a href="https://github.com/bastibe/org-journal">org-journal</a> is an extension to org-mode to easily create and maintain a
daily journal. I installed it and configured it as follows:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">require</span> <span class="ss">'org-journal</span><span class="p">)</span>

<span class="o">#</span> <span class="nv">set</span> <span class="nv">the</span> <span class="nv">directory</span> <span class="nv">that</span> <span class="nv">will</span> <span class="nv">contain</span> <span class="nv">the</span> <span class="nv">journal</span> <span class="nv">files</span>
<span class="p">(</span><span class="nf">setq</span> <span class="nv">org-journal-dir</span> <span class="s">"~/repos/bitbucket.org/journal"</span><span class="p">)</span>

<span class="o">#</span> <span class="nv">set</span> <span class="nv">the</span> <span class="nv">format</span> <span class="nv">of</span> <span class="nv">each</span> <span class="nv">date</span> <span class="nv">heading,</span> <span class="nv">where</span>
<span class="o">#</span> <span class="nv">-</span> <span class="nv">%F</span> <span class="nv">specifies</span> <span class="nv">the</span> <span class="nv">ISO</span> <span class="mi">8601</span> <span class="nv">date</span> <span class="nv">format,</span> <span class="nv">e</span><span class="o">.</span><span class="nv">g</span><span class="o">.</span> <span class="mi">2017-08-08</span><span class="o">,</span> <span class="nv">and</span>
<span class="o">#</span> <span class="nv">-</span> <span class="nv">%a</span> <span class="nv">specifies</span> <span class="nv">the</span> <span class="nv">locale</span><span class="ss">'s</span> <span class="nv">abbreviated</span> <span class="nv">name</span> <span class="nv">of</span> <span class="nv">the</span> <span class="nv">day</span> <span class="nv">of</span> <span class="nv">week</span>
<span class="p">(</span><span class="nf">setq</span> <span class="nv">org-journal-date-format</span> <span class="s">"%F, %a"</span><span class="p">)</span>
</pre></div>
<p>
For the list of allowed characters in the date format string and their meaning,
have a look at the documentation of Emacs function format-time-string.
</p>

<p>
At the time of writing, my main Linux environment environment variable LC<sub>TIME</sub>
was set to nl<sub>NL</sub>.UTF-8 so the abbreviated name of the week was in Dutch. The
following Emacs settings makes sure that that name is in English:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">setq</span> <span class="nv">system-time-locale</span> <span class="s">"en_US.UTF-8"</span><span class="p">)</span>
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/emacs.html" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../categories/orgmode.html" rel="tag">orgmode</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="welcome-to-nikola.html" rel="prev" title="Welcome to Nikola">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-08-09-issues-when-opening-an-org-journal-file-from-the-calender.html" rel="next" title="Issues when opening an org-journal file from the calender">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
